src/ClientRuby/soapmsgs_ditBonjour_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:ditBonjour xmlns:n1="http://allan.ensup.eu/">
      <arg0>toto</arg0>
    </n1:ditBonjour>
  </env:Body>
</env:Envelope>